
## Plan Result (terraform/cloudflare/b0xp.io/dns)

[CI link](https://github.com/boxp/arch/actions/runs/8542160612)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.terraform_managed_resource_1e2fbbba66fdf0c6df71effb39d15b9c


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.terraform_managed_resource_1e2fbbba66fdf0c6df71effb39d15b9c will be created
  + resource "cloudflare_record" "terraform_managed_resource_1e2fbbba66fdf0c6df71effb39d15b9c" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pal"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "2416b3df-cdba-4370-a0c4-9a50aec1590c.cfargotunnel.com"
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":170,"Program":"tfcmt","SHA1":"4de36816778bea6827766dd7fa75f9034e5306bd","Target":"terraform/cloudflare/b0xp.io/dns","Vars":{},"WorkflowName":"pull_request_target"} -->